<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы аутентификации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются во время аутентификации для
    | различных сообщений которые мы должны вывести пользователю на экран.
    | Вы можете свободно изменять эти языковые ресурсы в соответствии
    | с требованиями вашего приложения.
    |
    */

    'failed' => 'Неверный код подтверждения или номер телефона',
    'out' => 'вышли из',
    'password' => 'Неверный Пароль.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, попробуйте еще раз через :seconds секунд.',
    'pass' => 'Пароль успешно изменен',
    'pass_error' => 'Пароль не изменен',
    'create_message' => 'Сообщение успешно отправлено',
    'not_verified' => 'Ваш аккаунт не подтвержден'
];
